stergiosba/State-Estimation-EtherCAT/ADIS16364_IMU_ECAT_SLAVE_F28388D_CPU/device/driverlib/inc/hw_memcfg.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the GSxACCPROT3 register
//
//*************************************************************************************************
#define MEMCFG_GSXACCPROT3_FETCHPROT_GS12   0x1U         // Fetch Protection For GS12 RAM
#define MEMCFG_GSXACCPROT3_CPUWRPROT_GS12   0x2U         // CPU WR Protection For GS12 RAM
#define MEMCFG_GSXACCPROT3_DMAWRPROT_GS12   0x4U         // DMA WR Protection For GS12 RAM
#define MEMCFG_GSXACCPROT3_FETCHPROT_GS13   0x100U       // Fetch Protection For GS13 RAM
#define MEMCFG_GSXACCPROT3_CPUWRPROT_GS13   0x200U       // CPU WR Protection For GS13 RAM
#define MEMCFG_GSXACCPROT3_DMAWRPROT_GS13   0x400U       // DMA WR Protection For GS13RAM
#define MEMCFG_GSXACCPROT3_FETCHPROT_GS14   0x10000U     // Fetch Protection For GS14 RAM
#define MEMCFG_GSXACCPROT3_CPUWRPROT_GS14   0x20000U     // CPU WR Protection For GS14 RAM
#define MEMCFG_GSXACCPROT3_DMAWRPROT_GS14   0x40000U     // DMA WR Protection For GS14RAM
#define MEMCFG_GSXACCPROT3_FETCHPROT_GS15   0x1000000U   // Fetch Protection For GS15 RAM
#define MEMCFG_GSXACCPROT3_CPUWRPROT_GS15   0x2000000U   // CPU WR Protection For GS15 RAM
#define MEMCFG_GSXACCPROT3_DMAWRPROT_GS15   0x4000000U   // DMA WR Protection For GS15RAM

//*************************************************************************************************
//
// The following are defines for the bit fields in the GSxTEST register
//
//*************************************************************************************************
#define MEMCFG_GSXTEST_TEST_GS0_S    0U
#define MEMCFG_GSXTEST_TEST_GS0_M    0x3U          // Selects the different modes for GS0 RAM
#define MEMCFG_GSXTEST_TEST_GS1_S    2U
#define MEMCFG_GSXTEST_TEST_GS1_M    0xCU          // Selects the different modes for GS1 RAM
#define MEMCFG_GSXTEST_TEST_GS2_S    4U
#define MEMCFG_GSXTEST_TEST_GS2_M    0x30U         // Selects the different modes for GS2 RAM
#define MEMCFG_GSXTEST_TEST_GS3_S    6U
#define MEMCFG_GSXTEST_TEST_GS3_M    0xC0U         // Selects the different modes for GS3 RAM
#define MEMCFG_GSXTEST_TEST_GS4_S    8U
#define MEMCFG_GSXTEST_TEST_GS4_M    0x300U        // Selects the different modes for GS4 RAM
#define MEMCFG_GSXTEST_TEST_GS5_S    10U
#define MEMCFG_GSXTEST_TEST_GS5_M    0xC00U        // Selects the different modes for GS5 RAM
#define MEMCFG_GSXTEST_TEST_GS6_S    12U
#define MEMCFG_GSXTEST_TEST_GS6_M    0x3000U       // Selects the different modes for GS6 RAM
#define MEMCFG_GSXTEST_TEST_GS7_S    14U
#define MEMCFG_GSXTEST_TEST_GS7_M    0xC000U       // Selects the different modes for GS7 RAM
#define MEMCFG_GSXTEST_TEST_GS8_S    16U
#define MEMCFG_GSXTEST_TEST_GS8_M    0x30000U      // Selects the different modes for GS8 RAM
#define MEMCFG_GSXTEST_TEST_GS9_S    18U
#define MEMCFG_GSXTEST_TEST_GS9_M    0xC0000U      // Selects the different modes for GS9 RAM
#define MEMCFG_GSXTEST_TEST_GS10_S   20U
#define MEMCFG_GSXTEST_TEST_GS10_M   0x300000U     // Selects the different modes for GS10 RAM
#define MEMCFG_GSXTEST_TEST_GS11_S   22U
#define MEMCFG_GSXTEST_TEST_GS11_M   0xC00000U     // Selects the different modes for GS11 RAM
#define MEMCFG_GSXTEST_TEST_GS12_S   24U
#define MEMCFG_GSXTEST_TEST_GS12_M   0x3000000U    // Selects the different modes for GS12 RAM
#define MEMCFG_GSXTEST_TEST_GS13_S   26U
#define MEMCFG_GSXTEST_TEST_GS13_M   0xC000000U    // Selects the different modes for GS13 RAM
#define MEMCFG_GSXTEST_TEST_GS14_S   28U
#define MEMCFG_GSXTEST_TEST_GS14_M   0x30000000U   // Selects the different modes for GS14 RAM
#define MEMCFG_GSXTEST_TEST_GS15_S   30U
#define MEMCFG_GSXTEST_TEST_GS15_M   0xC0000000U   // Selects the different modes for GS15 RAM

//*************************************************************************************************
//
// The following are defines for the bit fields in the GSxINIT register
//
//*************************************************************************************************
#define MEMCFG_GSXINIT_INIT_GS0    0x1U      // RAM Initialization control for GS0 RAM.
#define MEMCFG_GSXINIT_INIT_GS1    0x2U      // RAM Initialization control for GS1 RAM.
#define MEMCFG_GSXINIT_INIT_GS2    0x4U      // RAM Initialization control for GS2 RAM.
#define MEMCFG_GSXINIT_INIT_GS3    0x8U      // RAM Initialization control for GS3 RAM.
#define MEMCFG_GSXINIT_INIT_GS4    0x10U     // RAM Initialization control for GS4 RAM.
#define MEMCFG_GSXINIT_INIT_GS5    0x20U     // RAM Initialization control for GS5 RAM.
#define MEMCFG_GSXINIT_INIT_GS6    0x40U     // RAM Initialization control for GS6 RAM.
#define MEMCFG_GSXINIT_INIT_GS7    0x80U     // RAM Initialization control for GS7 RAM.
#define MEMCFG_GSXINIT_INIT_GS8    0x100U    // RAM Initialization control for GS8 RAM.
#define MEMCFG_GSXINIT_INIT_GS9    0x200U    // RAM Initialization control for GS9 RAM.
#define MEMCFG_GSXINIT_INIT_GS10   0x400U    // RAM Initialization control for GS10 RAM.
#define MEMCFG_GSXINIT_INIT_GS11   0x800U    // RAM Initialization control for GS11 RAM.
#define MEMCFG_GSXINIT_INIT_GS12   0x1000U   // RAM Initialization control for GS12 RAM.
#define MEMCFG_GSXINIT_INIT_GS13   0x2000U   // RAM Initialization control for GS13 RAM.
#define MEMCFG_GSXINIT_INIT_GS14   0x4000U   // RAM Initialization control for GS14 RAM.
#define MEMCFG_GSXINIT_INIT_GS15   0x8000U   // RAM Initialization control for GS15 RAM.

//*************************************************************************************************
//
// The following are defines for the bit fields in the GSxINITDONE register
//
//*************************************************************************************************
#define MEMCFG_GSXINITDONE_INITDONE_GS0    0x1U      // RAM Initialization status for GS0 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS1    0x2U      // RAM Initialization status for GS1 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS2    0x4U      // RAM Initialization status for GS2 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS3    0x8U      // RAM Initialization status for GS3 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS4    0x10U     // RAM Initialization status for GS4 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS5    0x20U     // RAM Initialization status for GS5 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS6    0x40U     // RAM Initialization status for GS6 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS7    0x80U     // RAM Initialization status for GS7 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS8    0x100U    // RAM Initialization status for GS8 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS9    0x200U    // RAM Initialization status for GS9 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS10   0x400U    // RAM Initialization status for GS10 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS11   0x800U    // RAM Initialization status for GS11 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS12   0x1000U   // RAM Initialization status for GS12 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS13   0x2000U   // RAM Initialization status for GS13 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS14   0x4000U   // RAM Initialization status for GS14 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS15   0x8000U   // RAM Initialization status for GS15 RAM.

//*************************************************************************************************
//
// The following are defines for the bit fields in the GSxRAMTEST_LOCK register
//
//*************************************************************************************************
#define MEMCFG_GSXRAMTEST_LOCK_GS0     0x1U          // GSxTEST.TEST_GS0 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS1     0x2U          // GSxTEST.TEST_GS1 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS2     0x4U          // GSxTEST.TEST_GS2 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS3     0x8U          // GSxTEST.TEST_GS3 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS4     0x10U         // GSxTEST.TEST_GS4 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS5     0x20U         // GSxTEST.TEST_GS5 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS6     0x40U         // GSxTEST.TEST_GS6 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS7     0x80U         // GSxTEST.TEST_GS7 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS8     0x100U        // GSxTEST.TEST_GS8 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS9     0x200U        // GSxTEST.TEST_GS9 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS10    0x400U        // GSxTEST.TEST_GS10 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS11    0x800U        // GSxTEST.TEST_GS11 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS12    0x1000U       // GSxTEST.TEST_GS12 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS13    0x2000U       // GSxTEST.TEST_GS13 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS14    0x4000U       // GSxTEST.TEST_GS14 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_GS15    0x8000U       // GSxTEST.TEST_GS15 LOCK
#define MEMCFG_GSXRAMTEST_LOCK_KEY_S   16U
#define MEMCFG_GSXRAMTEST_LOCK_KEY_M   0xFFFF0000U   // KEY field

//*************************************************************************************************
//
// The following are defines for the bit fields in the MSGxLOCK register
//
//*************************************************************************************************
#define MEMCFG_MSGXLOCK_LOCK_CPUTOCPU_MSGRAM0   0x1U     // CPUTOCPU RAM Lock bits
#define MEMCFG_MSGXLOCK_LOCK_CPUTOCLA1          0x2U     // CPUTOCLA1 RAM Lock bits
#define MEMCFG_MSGXLOCK_LOCK_CLA1TOCPU          0x4U     // CLA1TOCPU RAM Lock bits
#define MEMCFG_MSGXLOCK_LOCK_CLA1TODMA          0x20U    // CLA1TODMA RAM control fields lock bit
#define MEMCFG_MSGXLOCK_LOCK_DMATOCLA1          0x40U    // DMATOCLA1 RAM control fields lock bit
#define MEMCFG_MSGXLOCK_LOCK_CPUTOCPU_MSGRAM1   0x80U    // Lock bit of CPU to CPU MSG RAM1 control
                                                         // fields
#define MEMCFG_MSGXLOCK_LOCK_CPUTOCM_MSGRAM0    0x100U   // Lock bit of CPU to CM MSG RAM0 control
                                                         // fields
#define MEMCFG_MSGXLOCK_LOCK_CPUTOCM_MSGRAM1    0x200U   // Lock bit of CPU to CM MSG RAM1 control
                                                         // fields
#define MEMCFG_MSGXLOCK_LOCK_CLA2TODMA          0x400U   // Lock bit of CLA to DMA MSG RAM control
                                                         // fields
#define MEMCFG_MSGXLOCK_LOCK_DMATOCLA2          0x800U   // Lock bit of DMA to CLA MSG RAM control
                                                         // fields

//*************************************************************************************************
//
// The following are defines for the bit fields in the MSGxCOMMIT register
//
//*************************************************************************************************
#define MEMCFG_MSGXCOMMIT_COMMIT_CPUTOCPU_MSGRAM0   0x1U     // CPUTOCPU RAM control fields COMMIT
                                                             // bit
#define MEMCFG_MSGXCOMMIT_COMMIT_CPUTOCLA1          0x2U     // CPUTOCLA1 RAM control fields COMMIT
                                                             // bit
#define MEMCFG_MSGXCOMMIT_COMMIT_CLA1TOCPU          0x4U     // CLA1TOCPU RAM control fields COMMIT
                                                             // bit
#define MEMCFG_MSGXCOMMIT_COMMIT_CLA1TODMA          0x20U    // CLA1TODMA RAM control fields COMMIT
                                                             // bit
#define MEMCFG_MSGXCOMMIT_COMMIT_DMATOCLA1          0x40U    // DMATOCLA1 RAM control fields COMMIT
                                                             // bit
#define MEMCFG_MSGXCOMMIT_COMMIT_CPUTOCPU_MSGRAM1   0x80U    // Commint bit of CPU to CPU MSG RAM1
                                                             // control fields
#define MEMCFG_MSGXCOMMIT_COMMIT_CPUTOCM_MSGRAM0    0x100U   // Commint bit of CPU to CM MSG RAM0
                                                             // control fields
#define MEMCFG_MSGXCOMMIT_COMMIT_CPUTOCM_MSGRAM1    0x200U   // Commint bit of CPU to CM MSG RAM1
                                                             // control fields
#define MEMCFG_MSGXCOMMIT_COMMIT_CLATODMA_MSGRAM0   0x400U   // Commint bit of CLA to DMA MSG RAM
                                                             // control fields
#define MEMCFG_MSGXCOMMIT_COMMIT_DMATOCLA_MSGRAM1   0x800U   // Commint bit of DMA to CLA MSG RAM
                                                             // control fields

//*************************************************************************************************
//
// The following are defines for the bit fields in the MSGxACCPROT0 register
//
//*************************************************************************************************
#define MEMCFG_MSGXACCPROT0_CPUWRPROT_CPUTOCPU_MSGRAM0   0x2U   // CPU WR Protection For
                                                                // CPUTOCPU_MSGRAM0 RAM
#define MEMCFG_MSGXACCPROT0_DMAWRPROT_CPUTOCPU_MSGRAM0   0x4U   // DMA WR Protection For
                                                                // CPUTOCPU_MSGRAM0 RAM

//*************************************************************************************************
//
// The following are defines for the bit fields in the MSGxACCPROT1 register
//
//*************************************************************************************************
#define MEMCFG_MSGXACCPROT1_CPUWRPROT_CPUTOCPU_MSGRAM1   0x2000000U   // CPU WR Protection For
                                                                      // CPUTOCPU_MSGRAM1 RAM
#define MEMCFG_MSGXACCPROT1_DMAWRPROT_CPUTOCPU_MSGRAM1   0x4000000U   // DMA WR Protection For
                                                                      // CPUTOCPU_MSGRAM1RAM

//*************************************************************************************************
//
// The following are defines for the bit fields in the MSGxACCPROT2 register
//
//*************************************************************************************************
#define MEMCFG_MSGXACCPROT2_CPUWRPROT_CPUTOCM_MSGRAM0   0x2U     // CPU WR Protection For
                                                                 // CPUTOCM_MSGRAM0 RAM
#define MEMCFG_MSGXACCPROT2_DMAWRPROT_CPUTOCM_MSGRAM0   0x4U     // DMA WR Protection For
                                                                 // CPUTOCM_MSGRAM0 RAM
#define MEMCFG_MSGXACCPROT2_CPUWRPROT_CPUTOCM_MSGRAM1   0x200U   // CPU WR Protection For
                                                                 // CPUTOCM_MSGRAM1 RAM
#define MEMCFG_MSGXACCPROT2_DMAWRPROT_CPUTOCM_MSGRAM1   0x400U   // DMA WR Protection For
                                                                 // CPUTOCM_MSGRAM1RAM

//*************************************************************************************************
//
// The following are defines for the bit fields in the MSGxTEST register
//
//*************************************************************************************************
#define MEMCFG_MSGXTEST_TEST_CPUTOCPU_MSGRAM0_S   0U
#define MEMCFG_MSGXTEST_TEST_CPUTOCPU_MSGRAM0_M   0x3U       // CPU to CPU Mode Select
#define MEMCFG_MSGXTEST_TEST_CPUTOCLA1_S          2U
#define MEMCFG_MSGXTEST_TEST_CPUTOCLA1_M          0xCU       // CPU to CLA1 MSG RAM Mode Select
#define MEMCFG_MSGXTEST_TEST_CLA1TOCPU_S          4U
#define MEMCFG_MSGXTEST_TEST_CLA1TOCPU_M          0x30U      // CLA1 to CPU MSG RAM Mode Select
#define MEMCFG_MSGXTEST_TEST_CLA1TODMA_S          10U
#define MEMCFG_MSGXTEST_TEST_CLA1TODMA_M          0xC00U     // CLA1 to DMA MSG RAM Mode Select
#define MEMCFG_MSGXTEST_TEST_DMATOCLA1_S          12U
#define MEMCFG_MSGXTEST_TEST_DMATOCLA1_M          0x3000U    // DMA to CLA1 MSG RAM Mode Select
#define MEMCFG_MSGXTEST_TEST_CPUTOCPU_MSGRAM1_S   14U
#define MEMCFG_MSGXTEST_TEST_CPUTOCPU_MSGRAM1_M   0xC000U    // CPU to CPU Mode Select
#define MEMCFG_MSGXTEST_TEST_CPUTOCM_MSGRAM0_S    16U
#define MEMCFG_MSGXTEST_TEST_CPUTOCM_MSGRAM0_M    0x30000U   // CPU to CM Mode Select
#define MEMCFG_MSGXTEST_TEST_CPUTOCM_MSGRAM1_S    18U
#define MEMCFG_MSGXTEST_TEST_CPUTOCM_MSGRAM1_M    0xC0000U   // CPU to CM Mode Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the MSGxINIT register
//
//*************************************************************************************************
#define MEMCFG_MSGXINIT_INIT_CPUTOCPU_MSGRAM0   0x1U     // Initialization control for CPU to CPU
                                                         // MSG RAM0
#define MEMCFG_MSGXINIT_INIT_CPUTOCLA1          0x2U     // Initialization control for CPUTOCLA1
                                                         // MSG RAM
#define MEMCFG_MSGXINIT_INIT_CLA1TOCPU          0x4U     // Initialization control for CLA1TOCPU
                                                         // MSG RAM
#define MEMCFG_MSGXINIT_INIT_CLA1TODMA          0x20U    // Initialization control for CLA1 to DMA
                                                         // MSG RAM
#define MEMCFG_MSGXINIT_INIT_DMATOCLA1          0x40U    // Initialization control for DMA to CLA1
                                                         // MSG RAM
#define MEMCFG_MSGXINIT_INIT_CPUTOCPU_MSGRAM1   0x80U    // Initialization control for CPU to CPU
                                                         // MSG RAM1
#define MEMCFG_MSGXINIT_INIT_CPUTOCM_MSGRAM0    0x100U   // Initialization control for CPU to CM
                                                         // MSG RAM0
#define MEMCFG_MSGXINIT_INIT_CPUTOCM_MSGRAM1    0x200U   // Initialization control for CPU to CM
                                                         // MSG RAM1

//*************************************************************************************************
//
// The following are defines for the bit fields in the MSGxINITDONE register
//
//*************************************************************************************************
#define MEMCFG_MSGXINITDONE_INITDONE_CPUTOCPU_MSGRAM0   0x1U     // Initialization status for CPU
                                                                 // to CPU MSG RAM
#define MEMCFG_MSGXINITDONE_INITDONE_CPUTOCLA1          0x2U     // Initialization status for CPU
                                                                 // to CLA1 MSG RAM
#define MEMCFG_MSGXINITDONE_INITDONE_CLA1TOCPU          0x4U     // Initialization status for CLA1
                                                                 // to CPU MSG RAM
#define MEMCFG_MSGXINITDONE_INITDONE_CLA1TODMA          0x20U    // Initialization status for CLA1
                                                                 // to DMA MSG RAM
#define MEMCFG_MSGXINITDONE_INITDONE_DMATOCLA1          0x40U    // Initialization status for DMA
                                                                 // to CLA1 MSG RAM
#define MEMCFG_MSGXINITDONE_INITDONE_CPUTOCPU_MSGRAM1   0x80U    // Initialization status for CPU
                                                                 // to CPU MSG RAM1
#define MEMCFG_MSGXINITDONE_INITDONE_CPUTOCM_MSGRAM0    0x100U   // Initialization status for CPU
                                                                 // to CM MSG RAM0
#define MEMCFG_MSGXINITDONE_INITDONE_CPUTOCM_MSGRAM1    0x200U   // Initialization status for CPU
                                                                 // to CM MSG RAM1

//*************************************************************************************************
//
// The following are defines for the bit fields in the MSGxRAMTEST_LOCK register
//
//*************************************************************************************************
#define MEMCFG_MSGXRAMTEST_LOCK_CPUTOCPU_MSGRAM0   0x1U          // MSGxTEST.TEST_CPUTOCPU_MSGRAM0
                                                                 // LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_CPUTOCLA1          0x2U          // MSGxTEST.TEST_CPUTOCLA1 LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_CLA1TOCPU          0x4U          // MSGxTEST.TEST_CLA1TOCPU LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_CPUTOCLA2          0x8U          // MSGxTEST.TEST_CPUTOCLA2 LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_CLA2TOCPU          0x10U         // MSGxTEST.TEST_CLA2TOCPU LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_CLA1TODMA          0x20U         // MSGxTEST.TEST_CLA1TODMA LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_DMATOCLA1          0x40U         // MSGxTEST.TEST_DMATOCLA1 LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_CPUTOCPU_MSGRAM1   0x80U         // MSGxTEST.TEST_CPUTOCPU_MSGRAM1
                                                                 // LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_CPUTOCM_MSGRAM0    0x100U        // MSGxTEST.TEST_CPUTOCM_MSGRAM0
                                                                 // LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_CPUTOCM_MSGRAM1    0x200U        // MSGxTEST.TEST_CPUTOCM_MSGRAM1
                                                                 // LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_CLA2TODMA          0x400U        // MSGxTEST.TEST_CLA2TODMA LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_DMATOCLA2          0x800U        // MSGxTEST.TEST_DMATOCLA2 LOCK
#define MEMCFG_MSGXRAMTEST_LOCK_KEY_S              16U
#define MEMCFG_MSGXRAMTEST_LOCK_KEY_M              0xFFFF0000U   // KEY field

//*************************************************************************************************
//
// The following are defines for the bit fields in the ROM_LOCK register
//
//*************************************************************************************************
#define MEMCFG_ROM_LOCK_LOCK_BOOTROM      0x1U          // BOOTROM Lock bits
#define MEMCFG_ROM_LOCK_LOCK_SECUREROM    0x2U          // SECUREROM Lock bits
#define MEMCFG_ROM_LOCK_LOCK_CLADATAROM   0x4U          // CLADATAROM Lock bits
#define MEMCFG_ROM_LOCK_KEY_S             16U
#define MEMCFG_ROM_LOCK_KEY_M             0xFFFF0000U   // KEY field

//*************************************************************************************************
//
// The following are defines for the bit fields in the ROM_TEST register
//
//*************************************************************************************************
#define MEMCFG_ROM_TEST_TEST_BOOTROM_S      0U
#define MEMCFG_ROM_TEST_TEST_BOOTROM_M      0x3U    // Selects the different modes for BOOTROM
#define MEMCFG_ROM_TEST_TEST_SECUREROM_S    2U
#define MEMCFG_ROM_TEST_TEST_SECUREROM_M    0xCU    // Selects the different modes for SECUREROM
#define MEMCFG_ROM_TEST_TEST_CLADATAROM_S   4U
#define MEMCFG_ROM_TEST_TEST_CLADATAROM_M   0x30U   // Selects the different modes for CLADATAROM

//*************************************************************************************************
//
// The following are defines for the bit fields in the ROM_FORCE_ERROR register
//
//*************************************************************************************************
#define MEMCFG_ROM_FORCE_ERROR_FORCE_BOOTROM_ERROR      0x1U   // Force Bootrom Parity Error
#define MEMCFG_ROM_FORCE_ERROR_FORCE_SECUREROM_ERROR    0x2U   // Force SECUREROM Parity Error
#define MEMCFG_ROM_FORCE_ERROR_FORCE_CLADATAROM_ERROR   0x4U   // Force CLADATAROM Parity Error

